{
  "users": {
    "12345-test-user": {
      "dreams": [
        {
          "id": "55b19775-b609-432b-9fc5-b44575b2b5a1",
          "date": "2025-08-26",
          "originalText": "я с бизнес партнёром поехал во францию где моя одногруппница случайно заказала дорогую воду по 1 рубль за миллилитр причём всю, поэтому ей пришлось оплатить 19 тысяч рублей за воду (она почему-то заказала 19 литров). вроде бы ситуация разрулилась, а мы с бизнес партнёром остались заказывать еду сами. а потом я общался с игроком киберспортивной команды TeamSpirit зонтиксом обсуждал с ним что-то.\nПоследнее время всё не очень клеется в моём деле, возникли непредвиденные расходы и я чувствую себя виноватым",
          "activeLens": "psychoanalytic",
          "title": "Плата за равновесие",
          "keyImages": [
            "дорогая вода",
            "оплата 19 000",
            "заказ еды с партнёром",
            "разговор с киберспортсменом"
          ],
          "snapshotSummary": "Сон ставит в центр чувство вины и финансовой ответственности: случайная крупная оплата другой женщины, совместные решения с партнёром и затем диалог с внешним, статусным человеком отражают стремление сохранить гармонию и контроль, несмотря на неожиданные убытки и сомнения в делах.",
          "lenses": {
            "psychoanalytic": {
              "insights": [
                {
                  "name": "Аффект: вина и ответственность",
                  "description": "Эмоция вины в сновидении проявляется через чужую ошибку, которую вы чувствуете сопричастной: сумма в 19 тысяч и образ «дорогой воды» материализуют чувство, что ресурсы уходят зря и это — ваша ответственность. Эмоциональная окраска сна — тревога, стыд и желание исправить ситуацию — говорит о текущем эмоциональном напряжении в рабочей сфере."
                },
                {
                  "name": "Защитные механизмы: проекция и рационализация",
                  "description": "Сцена с одногруппницей, оплатившей воду, функционирует как проекция: вы переносите страхи о финансовых потерях на образ другого человека, чтобы дистанцироваться от собственной уязвимости. Одновременное «вроде бы всё разрулилось» показывает рационализацию — ум пытается снизить тревогу, разрешая сюжет без драматической конфронтации."
                },
                {
                  "name": "Отношения и границы: партнерство и внешний авторитет",
                  "description": "Вы и бизнес-партнёр, заказывающие еду сами, показываете отдельную зону ответственности и границ внутри делового союза; разговор с игроком TeamSpirit представляет контакт с внешним, идеализированным миром успеха и статуса. Эти образы указывают на конфликт между внутренним стремлением к безопасности и внешними ожиданиями признания."
                }
              ],
              "schools": {
                "freud": {
                  "title": "По Фрейду",
                  "content": "Ключевой образ — дорогая вода. С точки зрения этого подхода, вода символизирует жизненную энергию и либидо; цена и объём (19 литров) указывают на фиксацию на затратах и потере сексуально-эмоциональной энергии в социальной ситуации. Ситуация с оплатой чужой ошибки отражает бессознательную боязнь быть наказанным за желания или импульсы, которые вы считаете неприемлемыми."
                },
                "jung": {
                  "title": "По Юнгу",
                  "content": "Ключевой образ — вода с высокой «ценой». С позиции этого подхода вода представляет символ бессознательного и эмоций; её дороговизна указывает на бессознательную ценность, которую вы придаёте эмоциональным переживаниям и их выражению. Сцена намекает на раскол между внутренней потребностью в эмоциональной близости и коллективными ожиданиями, а сумма 19 может быть личным архетипическим числом перехода — цена за интеграцию части себя."
                },
                "adler": {
                  "title": "По Адлеру",
                  "content": "Ключевой образ — бизнес-партнёр и совместный заказ еды. В этой системе акцент на социальном положении и стремлении к признанию: совместное поведение показывает стремление к сотрудничеству и равновесию, а чувство вины связано с переживанием неудачи в общественно-значимой задаче. Сон демонстрирует борьбу между желанием быть компетентным социально и страхом подвести группу."
                }
              },
              "recommendation": {
                "title": "Разговор с внутренним счётчиком",
                "content": "Сделайте паузу и задайте себе ряд строгих, но доброжелательных вопросов: что вы действительно контролируете в текущих затратах и на что вы бессознательно перекладываете ответственность? В тишине записывайте мысли о том, какие решения были намеренными, а какие — продиктованы страхом потерять статус; это поможет отделить реальные финансовые факты от моральных обвинений, которые беспокоят вас бессознательно.\nВо время размышления обращайте внимание на язык вины: когда вы слышите внутреннее «я виноват», остановитесь и спросите — что конкретно вы могли сделать иначе, и чему этот опыт вас учит? Ведите короткий дневник внутренних диалогов после рабочих дней: это улучшит границы между личной ценностью и рабочими результатами и снизит автоматическую склонность брать на себя ответственность за обстоятельства, которые вне вашего контроля."
              },
              "title": "Психоанализ"
            },
            "tarot": {
              "title": "Таро",
              "spread": [
                {
                  "position": "Причина Сна",
                  "cardName": "Мир",
                  "interpretation": "Мир (Причина Сна): В энергии этой карты скрыт итоговый запрос — потребность завершения и целостности. Во сне это проявляется как стремление привести ситуацию к завершению после финансовой нестыковки: вы хотите, чтобы хаос с оплатой воды приобрёл порядок, чтобы восстановилось чувство завершённости в бизнесе."
                },
                {
                  "position": "Тема Сна",
                  "cardName": "Звезда",
                  "interpretation": "Звезда (Тема Сна): Звезда приносит надежду и утешение после тревоги; образ дорогой воды и последующего «вроде всё разрулилось» отражает желание вернуть веру в процесс. Эта карта показывает, что внутри вас есть надежда на исцеление репутации и восстановление потерь — тихая вера в лучшее будущее."
                },
                {
                  "position": "Препятствие/Блок",
                  "cardName": "Справедливость",
                  "interpretation": "Справедливость (Препятствие/Блок): Справедливость указывает на вопросы ответственности и возмездия — блок в сне выражается через чувство вины и подсчёт расходов: вы переживаете о том, кто и как должен платить за ошибки. Карта указывает на тяжесть морального счёта, которая мешает двигаться дальше."
                },
                {
                  "position": "Послание/Совет",
                  "cardName": "Дурак",
                  "interpretation": "Дурак (Послание/Совет): Дурак советует рискнуть новым подходом и отпустить перфекционизм страха. В контексте сна это предложение позволить себе начать заново в делах, принять неопределённость и не зацикливаться на прошлых ошибках как на определителях собственной ценности."
                },
                {
                  "position": "Урок/Потенциал",
                  "cardName": "Луна",
                  "interpretation": "Луна (Урок/Потенциал): Луна подчёркивает глубинные эмоции и неочевидные страхи, которые нуждаются в исследовании. Она предлагает принять своё внутреннее беспокойство и использовать его как источник интуиции: страхи о деньгах и вине могут раскрыть скрытые потребности и указать путь к истинным внутренним ресурсам."
                }
              ],
              "summary": "Колода описывает цикл: из глубокого желания целостности (Мир) рождается надежда (Звезда), но ответственность и самооценочные счёты (Справедливость) блокируют движение. Совет — сделать шаг в неизвестность с лёгкостью (Дурак), прислушиваясь к подсказкам бессознательного (Луна), чтобы трансформировать вину в источник интуиции и нового начала.",
              "state": {
                "isRevealed": true
              }
            },
            "astrology": {
              "title": "Астрология",
              "celestialMap": {
                "moonPhase": {
                  "name": "Новолуние",
                  "phase": "new_moon",
                  "text": "Новолуние в Весах создаёт сцену новых начинаний, которые разворачиваются через призму отношений и поиска равновесия. Эта лунная конфигурация могла породить сюжет, где финансовая ошибка и её разрешение становятся полем для восстановления справедливости и гармонии между вами и партнёрами. Новая лунная энергия в Весах подталкивает к переоценке того, какие договорённости вам действительно важны и где нужно восстановить баланс."
                },
                "moonSign": {
                  "name": "Весы",
                  "emoji": "♎",
                  "text": "Новолуние в Весах создаёт сцену новых начинаний, которые разворачиваются через призму отношений и поиска равновесия. Эта лунная конфигурация могла породить сюжет, где финансовая ошибка и её разрешение становятся полем для восстановления справедливости и гармонии между вами и партнёрами. Новая лунная энергия в Весах подталкивает к переоценке того, какие договорённости вам действительно важны и где нужно восстановить баланс."
                }
              },
              "topTransits": {
                "title": "Ключевые Транзиты",
                "insights": [
                  {
                    "p1": "pluto",
                    "p2": "neptune",
                    "aspect": "conjunction",
                    "power": 9,
                    "tagline": "Плутон в соединении к Нептун",
                    "title": "Влияние: Плутон и Нептун",
                    "interpretation": "Плутон в соединении с натальным Нептун усиливает трансформацию внутренней фантазии и идеалов — во сне это проявляется как искажение ценности (дорогая вода): то, что вы считали само собой разумеющимся, вдруг становится переоценённым и требует глубокого пересмотра.",
                    "lesson": "Используйте эту энергию, чтобы пересмотреть свои финансовые и идеологические представления: трансформируйте иллюзии о безопасности в более реалистичную, но внутренне значимую версию ваших целей."
                  },
                  {
                    "p1": "pluto",
                    "p2": "mercury",
                    "aspect": "opposition",
                    "power": 9,
                    "tagline": "Плутон в оппозиции к Меркурий",
                    "title": "Влияние: Плутон и Меркурий",
                    "interpretation": "Плутон в оппозиции к Меркурию создаёт психологическое давление на коммуникацию и расчёт — в сне это отразилось в ситуациях ошибочных заказов и необходимости «разрулить» последствия: слова и договорённости могут искажаться, увеличивая чувство вины и непредвиденные расходы.",
                    "lesson": "Будьте особенно внимательны к цифрам и формулировкам в деловой коммуникации; проясняйте условия письменно и позволяйте себе паузу перед реакцией, чтобы не принимать на себя лишнюю вину из-за коммуникационных сбоев."
                  },
                  {
                    "p1": "pluto",
                    "p2": "jupiter",
                    "aspect": "square",
                    "power": 8,
                    "tagline": "Плутон в квадрате к Юпитер",
                    "title": "Влияние: Плутон и Юпитер",
                    "interpretation": "Плутон в квадрате к Юпитеру акцентирует конфликт между желанием роста и необходимостью радикальных преобразований — в сне это видно в столкновении стремления к успеху (разговор с известным игроком) и реальностью затрат, которые подрывают планы.",
                    "lesson": "Урок в том, чтобы соотнести амбиции с ресурсами: вместо масштабных ставок рассмотрите глубокую реорганизацию подхода, чтобы рост не приходил ценой истощения."
                  }
                ],
                "explanation": "Этот блок является ядром Астрологической линзы. Его задача — ответить на главный вопрос пользователя: \"Почему именно этот сон приснился мне именно сейчас?\". Он должен показать связь между сюжетом сна и глубокими, долгосрочными психологическими процессами, которые происходят в вашей жизни, основываясь на объективных астрологических данных."
              },
              "cosmicPassport": {
                "sun": {
                  "title": "Солнце в знаке Рак",
                  "tagline": "Солнце в Раке подчеркивает вашу мотивацию через необходимость защищать и сохранять — сцена с оплатой воды символизирует угрозу безопасности и семейно-ориентированную заботу о ресурсах. Луна в Козероге показывает, что эмоции управляются через контроль и прагматизм; вы реагируете на потерю не бурно, а структурированно, пытаясь «разрулить» ситуацию и сохранить лицо. Вместе они объясняют сочетание внутренней уязвимости и внешнего стремления сохранять порядок, которое и проявилось в сне."
                },
                "moon": {
                  "title": "Луна в знаке Козерог",
                  "tagline": "Солнце в Раке подчеркивает вашу мотивацию через необходимость защищать и сохранять — сцена с оплатой воды символизирует угрозу безопасности и семейно-ориентированную заботу о ресурсах. Луна в Козероге показывает, что эмоции управляются через контроль и прагматизм; вы реагируете на потерю не бурно, а структурированно, пытаясь «разрулить» ситуацию и сохранить лицо. Вместе они объясняют сочетание внутренней уязвимости и внешнего стремления сохранять порядок, которое и проявилось в сне."
                }
              },
              "summary": "Астрологическая картина подчёркивает внутренний конфликт между желанием безопасности (Солнце в Раке), необходимостью эмоционального контроля (Луна в Козероге) и поиском внешнего равновесия (Новолуние в Весах). Транзиты Плутона указывают на период глубоких переформатирований в мышлении и коммуникации, что прямо отразилось в сюжетах сна о потерях, вине и необходимости реорганизовать деловые и психологические границы.",
              "explanation": "Этот блок является ядром Астрологической линзы. Его задача — ответить на главный вопрос пользователя: \"Почему именно этот сон приснился мне именно сейчас?\". Он должен показать связь между сюжетом сна и глубокими, долгосрочными психологическими процессами, которые происходят в вашей жизни, основываясь на объективных астрологических данных.",
              "state": {
                "viewedInsights": [
                  0,
                  1,
                  2,
                  3
                ],
                "isSummaryUnlocked": true,
                "currentIndex": 3
              }
            }
          }
        }
      ],
      "profile": {
        "birthDate": "28.06.1999",
        "birthTime": "14:15",
        "birthPlace": "Нижний Новгород, Нижегородская обл., Россия",
        "birthLatitude": 56.3268684,
        "birthLongitude": 44.0058793,
        "natalChart": {
          "planets": {
            "sun": {
              "longitude": 96.45407114526867
            },
            "moon": {
              "longitude": 273.03766873011887
            },
            "mercury": {
              "longitude": 121.9937512643635
            },
            "venus": {
              "longitude": 140.54155256367042
            },
            "mars": {
              "longitude": 208.00391383268087
            },
            "jupiter": {
              "longitude": 30.031550889748065
            },
            "saturn": {
              "longitude": 43.99676215624594
            },
            "uranus": {
              "longitude": 316.24852631836717
            },
            "neptune": {
              "longitude": 303.69320784415737
            },
            "pluto": {
              "longitude": 248.39262831517763
            }
          },
          "houses": {
            "cusps": [
              235.1273684202602,
              267.22248278538433,
              312.36588250044946,
              353.4538031703813,
              21.376658519879754,
              40.597959702346486,
              55.12736842026021,
              87.22248278538433,
              132.36588250044946,
              173.45380317038132,
              201.37665851987975,
              220.5979597023465
            ]
          },
          "ascendant": {
            "longitude": 235.1273684202602
          }
        }
      }
    },
    "dev_test_user_123": {
      "dreams": [],
      "profile": {
        "birthDate": "10.09.1999",
        "birthTime": "16:45",
        "birthPlace": ""
      }
    }
  }
}