{
  "users": {
    "12345-test-user": {
      "dreams": [
        {
          "id": "03f33f12-3fc9-4a10-8e85-41efabe296fb",
          "date": "2025-08-24",
          "originalText": "Мне приснилось, как мы с моим приятелем на набережной конфликтуем. И он агрессирует на меня. Позже идет с кулаками на меня. Я захватом валю на землю. А потом и вовсе ударами кладу его на землю. На этом сон заканчивается. Я чувствовал свое преимущество над ним. Не было чувство страха быть побежденным. Был на 100% уверен в своих силах. Но в жизни чувствую упадок. Все идет не так гладко, как хотелось бы. Многие процессы, которые казались очень простыми оказались намного сложнее. И тяжело за них браться, тк понимаешь, что придется возиться долго с этим. Многое кажется не приподъемным и нереальным к реализации.  Я рассказал свои ощущения из жизни, чтобы ты понимал контраст сна и реальных ощущений и чувств в жизни.",
          "activeLens": "tarot",
          "title": "Победа над неуверенностью",
          "keyImages": [
            "набережная",
            "драка с приятелем",
            "повержение на землю",
            "уверенность без страха"
          ],
          "snapshotSummary": "Сон показывает внезапное и полное возвышение силы там, где в реальной жизни вы испытываете истощение и сомнения. Образ агрессирующего приятеля и ваше уверенное превосходство выражают компенсаторный сценарий: во сне вы переживаете контроль и уверенность, которых наяву не хватает. Конфликт на набережной связан с границами, публичным самовосприятием и необходимостью переработать сложные проекты и усталость.",
          "lenses": {
            "psychoanalytic": {
              "insights": [
                {
                  "name": "Аффект и компенсация",
                  "description": "Эмоция сна — безусловная уверенность и превосходство — выступает как компенсация реального упадка. Когда наяву вы ощущаете истощение и перегруженность, психика создаёт сценарий, где вы контролируете ситуацию физически и морально; это снимает внутреннее напряжение и восстанавливает самооценку на символическом уровне."
                },
                {
                  "name": "Защитные механизмы и агрессия",
                  "description": "Сцена с физической победой показывает активно мобилизованную агрессию как защитный механизм — не как желание навредить, а как инструмент установления границ. Вы не испытываете страха поражения: это не репетиторский страх, а демонстрация силы Я-эго, которое налагает порядок и предотвращает уязвимость."
                },
                {
                  "name": "Объектные отношения и символический Друг",
                  "description": "Приятель в сне функционирует как «внешний объект», с которым вы репетируете внутренний конфликт — внутренние части, которые саботируют или усложняют ваши проекты. Укладка его на землю — символ реструктуризации отношений с этой частью: вы не уничтожаете её, а подчиняете и интегрируете."
                }
              ],
              "schools": {
                "freud": {
                  "title": "Фрейдианский анализ",
                  "content": "С позиции классического анализа конфликт виден как вытеснение: наружная драка символизирует внутреннюю борьбу Эго с влечениями и тревогой неполноценности. Телесность победы — замещение тревоги власти и комплектности, сублимированное в акте контроля."
                },
                "jung": {
                  "title": "Юнгианский анализ",
                  "content": "Юнгиански это архетипическое столкновение с Теневым. Приятель — внешнее проявление теневых качеств (апатия, саботаж, неэффективность), а ваша победа — интеграция и осознание этих качеств как источника силы. Сон указывает на шаг к индивидуации: вы встречаете и укрощаете тень."
                },
                "adler": {
                  "title": "Адлерианский анализ",
                  "content": "По Адлеру сон выражает стремление к превосходству и компенсацию чувства неполноценности. Ваши нынешние трудности активировали мотив повышения статуса: во сне вы демонстрируете, что способны действовать решительно и доминировать, чтобы восстановить чувство значимости."
                }
              },
              "recommendations": [
                {
                  "title": "Признать компенсацию",
                  "content": "Отметьте, что уверенность сна — ответ на истощение реальной жизни. Запишите, в каких ситуациях чувствуете упадок, и где хотели бы вернуть контроль; отделите ночную «победу» как ресурс, но не как прямое решение."
                },
                {
                  "title": "Практика границ и небольших побед",
                  "content": "Вместо попытки тотально решить сложные проекты за раз, разбейте задачи на управляемые шаги и назначьте маленькие «поединки», где вы добьётесь видимого результата. Это поможет перенести ощущение контроля из сна в реальность."
                }
              ],
              "title": "Психоанализ"
            },
            "tarot": {
              "title": "Таро",
              "spread": [
                {
                  "position": "Причина Сна",
                  "cardName": "Мир",
                  "interpretation": "Причина Сна — Мир: Ваша бессознательная потребность завершить цикл и обрести чувство целостности породила сон. Набережная и финальная победа — метафора закрытия долгого процесса, где вы снова чувствуете себя завершённым и интегрированным."
                },
                {
                  "position": "Тема Сна",
                  "cardName": "Маг",
                  "interpretation": "Тема Сна — Маг: Тема сна — восстановление способности действовать и творить: вы — активный агент, использующий навыки и волю. Сцена, где вы ловко повалили и уложили противника, отражает магическую уверенность ваших внутренних ресурсов, которые во сне работают без промедления."
                },
                {
                  "position": "Препятствие/Блок",
                  "cardName": "Дурак",
                  "interpretation": "Препятствие/Блок — Дурак: Препятствие — склонность к легкомыслию, неоправданным рискам или стремлению начать что-то без плана. В контексте сна это часть, которая провоцирует конфликт (приятель как провокация) и мешает стабильно двигаться в реальной жизни, делая проекты нереалистичными и хаотичными."
                },
                {
                  "position": "Послание/Совет",
                  "cardName": "Умеренность",
                  "interpretation": "Послание/Совет — Умеренность: Совет — найти баланс между напором и терпением. Энергия Умеренности предлагает не тушить агрессию, а направлять её последовательно: чередовать усилия и восстановление, аккуратно интегрировать уверенность сна в практические шаги наяву."
                },
                {
                  "position": "Урок/Потенциал",
                  "cardName": "Звезда",
                  "interpretation": "Урок/Потенциал — Звезда: Потенциал сна — возрождение надежды и восстановление веры в свои силы. Звезда обещает, что эта пережитая в сне уверенность может стать источником вдохновения и устойчивого восстановления, если вы сохраните открытость и оптимизм."
                }
              ],
              "summary": "Таро связывает сон с желанием целостности и восстановлением агентности: Мир объясняет причину, Маг показывает активное положение Я, Дурак указывает на риск незрелых начинаний, Умеренность советует баланс, а Звезда даёт надежду на долгосрочное восстановление. Карты подтверждают: сон — ресурс уверенности, но путь реалистичен через умеренные шаги.",
              "state": {
                "isRevealed": true
              }
            },
            "astrology": {
              "title": "Астрология",
              "celestialMap": {
                "moonPhase": {
                  "name": "Новолуние",
                  "phase": "new_moon",
                  "text": "Новолуние даёт ощущение зарождения скрытой силы: сюжет сна — внезапное начало внутреннего обновления, когда появляется ресурс уверенности. Луна в Деве заставляет этот новый импульс быть проработанным через анализ и внимание к деталям: сцена на набережной — символ публичного «тестирования» этой новой энергии с акцентом на порядок и эффективность."
                },
                "moonSign": {
                  "name": "Дева",
                  "emoji": "♍",
                  "text": "Новолуние даёт ощущение зарождения скрытой силы: сюжет сна — внезапное начало внутреннего обновления, когда появляется ресурс уверенности. Луна в Деве заставляет этот новый импульс быть проработанным через анализ и внимание к деталям: сцена на набережной — символ публичного «тестирования» этой новой энергии с акцентом на порядок и эффективность."
                }
              },
              "topTransits": {
                "title": "Ключевые Транзиты",
                "insights": [
                  {
                    "p1": "pluto",
                    "p2": "neptune",
                    "aspect": "conjunction",
                    "power": 9,
                    "tagline": "Плутон в соединении к Нептун",
                    "title": "Влияние: Плутон и Нептун",
                    "interpretation": "Плутон в соединении с натальным Нептун усиливает трансформацию ваших внутренних образов и мечтаний; сон, где вы одерживаете победу над знакомым образом (приятелем), отражает перелом в восприятии собственных возможностей — иллюзии уступают глубинной перестройке чувств.",
                    "lesson": "Урок — использовать эту глубинную трансформацию для пересмотра идеалов и обретения нового творческого видения: позволяйте снам и образам реформировать цели и вдохновение."
                  },
                  {
                    "p1": "pluto",
                    "p2": "mercury",
                    "aspect": "opposition",
                    "power": 9,
                    "tagline": "Плутон в оппозиции к Меркурий",
                    "title": "Влияние: Плутон и Меркурий",
                    "interpretation": "Плутон в оппозиции к натальному Меркурию проявляет внутренний конфликт мысли и силы: вы ощущаете, что рациональные планы блокируются внутренним давлением и кризисом коммуникаций; в сне это выражается как прямой конфликт и быстрое телесное разрешение ситуации.",
                    "lesson": "Урок — работать с коммуникацией и ментальными стратегиями: перевести агрессивную энергию в ясные, поэтапные планы, иначе сила будет расходоваться в конфликте, а не в достижении целей."
                  },
                  {
                    "p1": "pluto",
                    "p2": "jupiter",
                    "aspect": "square",
                    "power": 8,
                    "tagline": "Плутон в квадрате к Юпитер",
                    "title": "Влияние: Плутон и Юпитер",
                    "interpretation": "Плутон в квадрате к натальному Юпитеру создаёт напряжение между желанием роста и обстоятельствами; реальная жизнь кажется не имеющей опоры, и сон компенсирует это полной уверенностью. Это указывает на риск слишком амбициозных ожиданий или разочарования в масштабных планах.",
                    "lesson": "Урок — умерить масштаб и проверить реалистичность целей: разбивайте большие дела на реальные этапы и избегайте перепрограммирования амбиций без опоры на методы и ресурсы."
                  }
                ],
                "explanation": "Этот блок является ядром Астрологической линзы. Его задача — ответить на главный вопрос пользователя: \"Почему именно этот сон приснился мне именно сейчас?\". Он должен показать связь между сюжетом сна и глубокими, долгосрочными психологическими процессами, которые происходят в вашей жизни, основываясь на объективных астрологических данных."
              },
              "cosmicPassport": {
                "sun": {
                  "title": "Солнце в знаке Рак",
                  "tagline": "Солнце в Раке подчёркивает вашу потребность в безопасности и заботе: сон с победой — символический акт восстановления этой безопасности через контроль над внешними угрозами. Луна в Козероге даёт эмоциональную дисциплину: в сне вы проявляете именно контролируемую, деловую агрессию — не истерику, а расчётный приём, что отражает вашу потребность управлять чувствами ради устойчивости."
                },
                "moon": {
                  "title": "Луна в знаке Козерог",
                  "tagline": "Солнце в Раке подчёркивает вашу потребность в безопасности и заботе: сон с победой — символический акт восстановления этой безопасности через контроль над внешними угрозами. Луна в Козероге даёт эмоциональную дисциплину: в сне вы проявляете именно контролируемую, деловую агрессию — не истерику, а расчётный приём, что отражает вашу потребность управлять чувствами ради устойчивости."
                }
              },
              "summary": "Астрологически сон возникает в момент новой внутренней инициативы (новолуние) под аналитическим влиянием Девы и при глубоких трансформациях Плутона. Комбинация Рака и Козерога в вашей карте создаёт сюжет: вы стремитесь вернуть эмоциональную безопасность через дисциплину и структурирование. Транзитные аспекты указывают на мощную, но напряжённую трансформацию — её успех потребует перевода силы в продуманные шаги и реалистичные планы.",
              "explanation": "Этот блок является ядром Астрологической линзы. Его задача — ответить на главный вопрос пользователя: \"Почему именно этот сон приснился мне именно сейчас?\". Он должен показать связь между сюжетом сна и глубокими, долгосрочными психологическими процессами, которые происходят в вашей жизни, основываясь на объективных астрологических данных.",
              "state": {
                "viewedInsights": [
                  0,
                  1,
                  2,
                  3
                ],
                "isSummaryUnlocked": true,
                "currentIndex": 3
              }
            },
            "culturology": {
              "title": "Культурология",
              "preface": {
                "title": "Макро-анализ Сновидения",
                "content": "Это моковое предисловие для линзы Культурология."
              },
              "analysis": [
                {
                  "title": "Моковый Архетип 1",
                  "content": "Это моковый анализ для первого архетипа."
                }
              ],
              "insight": {
                "title": "Моковый Инсайт",
                "content": "Это моковый инсайт.",
                "recommendation": "Это моковая рекомендация."
              }
            }
          }
        }
      ],
      "profile": {
        "birthDate": "28.06.1999",
        "birthTime": "14:15",
        "birthPlace": "Нижний Новгород, Нижегородская обл., Россия",
        "birthLatitude": 56.3268684,
        "birthLongitude": 44.0058793,
        "natalChart": {
          "planets": {
            "sun": {
              "longitude": 96.45407114526867
            },
            "moon": {
              "longitude": 273.03766873011887
            },
            "mercury": {
              "longitude": 121.9937512643635
            },
            "venus": {
              "longitude": 140.54155256367042
            },
            "mars": {
              "longitude": 208.00391383268087
            },
            "jupiter": {
              "longitude": 30.031550889748065
            },
            "saturn": {
              "longitude": 43.99676215624594
            },
            "uranus": {
              "longitude": 316.24852631836717
            },
            "neptune": {
              "longitude": 303.69320784415737
            },
            "pluto": {
              "longitude": 248.39262831517763
            }
          },
          "houses": {
            "cusps": [
              235.1273684202602,
              267.22248278538433,
              312.36588250044946,
              353.4538031703813,
              21.376658519879754,
              40.597959702346486,
              55.12736842026021,
              87.22248278538433,
              132.36588250044946,
              173.45380317038132,
              201.37665851987975,
              220.5979597023465
            ]
          },
          "ascendant": {
            "longitude": 235.1273684202602
          }
        }
      }
    }
  }
}