{
  "users": {
    "dev_test_user_123": {
      "dreams": [
        {
          "id": "d64c7ffb-10b2-49cb-bdd4-cec21f8caaee",
          "date": "2025-09-30",
          "originalText": "f",
          "title": "Mock: f...",
          "snapshotSummary": "Это mock интерпретация для разработки UI. Настоящий анализ сна: \"f...\"",
          "lenses": {},
          "activeLens": null
        },
        {
          "id": "dd7b4b7c-d3b1-4690-8450-bc9728e8ced7",
          "date": "2025-09-30",
          "originalText": "'",
          "title": "Mock: '...",
          "snapshotSummary": "Это mock интерпретация для разработки UI. Настоящий анализ сна: \"'...\"",
          "lenses": {},
          "activeLens": null
        },
        {
          "id": "d9bae259-873f-4817-ad38-57b053a6cda1",
          "date": "2025-09-30",
          "originalText": "э",
          "title": "Mock: э...",
          "snapshotSummary": "Это mock интерпретация для разработки UI. Настоящий анализ сна: \"э...\"",
          "lenses": {
            "psychoanalytic": {
              "title": "Психоанализ",
              "insights": [
                {
                  "name": "Поиск внутреннего убежища",
                  "description": "Пещера в вашем сне — это не просто место, а символ безопасности и уединения. То, как вы ее исследуете, говорит о подсознательном желании найти защищенное пространство для саморефлексии, вдали от внешнего давления."
                },
                {
                  "name": "Конфликт с внутренним 'Я'",
                  "description": "Препятствия на пути к выходу из пещеры символизируют внутренние барьеры, которые вы сами себе устанавливаете. Возможно, существует часть вас, которая сопротивляется изменениям или боится неопределенности будущего."
                },
                {
                  "name": "Порог зрелости",
                  "description": "Свет, который вы видите в конце, — это не только выход, но и символ новой цели или нового этапа в жизни. Ваше стремление к нему говорит о готовности к личностному росту и принятию новых вызовов."
                }
              ],
              "schools": {
                "freud": {
                  "title": "По Фрейду",
                  "content": "С точки зрения Фрейда, ваш сон — это театр бессознательного. Хрустальная пещера — это не просто символ убежища или материнской утробы, это пространство, где ваши подавленные желания (либидо) и неразрешенные конфликты раннего детства выходят на поверхность. Река света — это поток вашей психической энергии, которая ищет выход."
                },
                "jung": {
                  "title": "По Юнгу",
                  "content": "Юнгианский анализ видит в вашем сне путешествие к индивидуации — процессу становления целостной личности. Пещера — это архетип Великого Материнского, вход в глубины коллективного бессознательного. Кристаллы — это символы Самости, вашего истинного внутреннего центра, сияющего и многогранного."
                },
                "adler": {
                  "title": "По Адлеру",
                  "content": "С точки зрения Адлера, сон подчеркивает ваше стремление к преодолению чувства неполноценности. Пещера — это начальная точка, 'минус', из которого вы стремитесь к 'плюсу' — свету, символизирующему признание и самореализацию. Весь сюжет сна — это метафора вашего жизненного стиля, направленного на рост и компенсацию."
                }
              },
              "recommendation": {
                "title": "Практика сострадания к себе",
                "content": "Ваш сон говорит о глубокой потребности в безопасности и принятии. Вместо того чтобы критиковать себя за внутренние конфликты или страхи, попробуйте отнестись к этим чувствам с добротой, как если бы вы утешали близкого друга. Спросите себя: 'Какую мою потребность сейчас игнорируют? В какой поддержке я нуждаюсь?'.\n\nЭтот сдвиг от самокритики к самосостраданию — не потакание слабостям, а ключ к внутренней силе. Признавая свои уязвимые стороны без осуждения, вы перестаете тратить энергию на борьбу с собой и освобождаете ее для реального роста и движения к 'свету', который вы видели во сне."
              }
            }
          },
          "activeLens": null
        }
      ],
      "profile": {}
    }
  }
}