{
  "users": {
    "12345-test-user": {
      "dreams": [
        {
          "id": "8addc96f-ebd6-4c9e-b903-fe2ca2dedf51",
          "date": "2025-07-31",
          "originalText": "'",
          "title": "Путешествие по Хрустальной Пещере",
          "keyImages": [
            "кристаллы",
            "пещера",
            "река",
            "свет"
          ],
          "snapshotSummary": "Этот сон символизирует путь самопознания и внутренней ясности. Хрустальная пещера представляет ваш внутренний мир, а река света предполагает, что для вас открывается путь духовного и эмоционального просветления.",
          "lenses": {
            "psychoanalytic": {
              "title": "Психоанализ",
              "paragraphs": {
                "freud": {
                  "title": "По Фрейду",
                  "content": "Пещера — классический символ утробы и возвращения в безопасное, защищенное состояние. Текущая река света может представлять либидинозную энергию, предполагая здоровый и творческий поток вашей жизненной силы и подавленных желаний, ищущих выражения."
                },
                "jung": {
                  "title": "По Юнгу",
                  "content": "Пещера — это бессознательное, а кристаллы внутри — символы Самости, отражающие индивидуацию и целостность. Свет — это зов вашего внутреннего «я» исследовать эти скрытые глубины и интегрировать их в вашу сознательную личность."
                },
                "adler": {
                  "title": "По Адлеру",
                  "content": "Этот сон предполагает сильное стремление преодолеть чувство неполноценности, ища уникальный и «блестящий» путь (река света). Вы стремитесь к ощущению мастерства и значимости в вашем личном путешествии."
                },
                "lacan": {
                  "title": "По Лакану",
                  "content": "Отражающие поверхности кристалла связаны с Зеркальной стадией, поиском идеализированного образа себя. Путешествие по пещере — метафора навигации по символическому порядку, использования языка и символов для понимания собственного существования."
                },
                "perls": {
                  "title": "По Перлзу (Гештальт)",
                  "content": "Пещера и ее кристаллы — это проецируемые части вас самих. Сон — это приглашение «принять» эти блестящие, чистые и структурированные части вашей личности, которые вы, возможно, не полностью осознаете в своей бодрствующей жизни."
                }
              }
            },
            "esoteric": {
              "title": "Эзотерика",
              "paragraphs": {
                "miller": {
                  "title": "Сонник Миллера",
                  "content": "Видеть во сне чистые, сверкающие кристаллы предвещает процветание и искреннюю дружбу. Пещера означает, что вы преодолеете своих врагов и препятствия благодаря своим скрытым талантам и усилиям."
                },
                "taro": {
                  "title": "Архетипы Таро",
                  "content": "Этот образ тесно связан с картой «Звезда», которая символизирует надежду, вдохновение и глубокую связь с космосом. Путь — это ваш путь к духовному обновлению и ясному ощущению цели."
                },
                "kabbalah": {
                  "title": "Каббалистический мистицизм",
                  "content": "Пещеру можно рассматривать как Малкут (Царство), вашу физическую реальность, которую вы освещаете светом Кетер (Короны) или высшего сознания. Кристаллы — это грани божественной мудрости, которые вы открываете."
                }
              }
            },
            "astrology": {
              "title": "Астрология",
              "paragraphs": {
                "astrological": {
                  "title": "Астрологический подход",
                  "content": "Этот сон может отражать мощный транзит Нептуна, растворяющий старые границы и открывающий вас для духовных прозрений. Ясность кристаллов может быть влиянием Меркурия, приносящим ясные мысли о вашем внутреннем мире."
                },
                "numerology": {
                  "title": "Нумерология",
                  "content": "Количество ключевых образов — четыре, что символизирует стабильность, структуру и заземление. Ваше духовное путешествие, хотя и просвещающее, ведет вас к построению более стабильного и надежного фундамента в вашей жизни."
                }
              }
            },
            "folkloric": {
              "title": "Фольклор",
              "paragraphs": {
                "miller": {
                  "title": "Сонник Миллера",
                  "content": "Видеть во сне чистые, сверкающие кристаллы предвещает процветание и искреннюю дружбу. Пещера означает, что вы преодолеете своих врагов и препятствия благодаря своим скрытым талантам и усилиям."
                },
                "tsvetkov": {
                  "title": "Сонник Цветкова",
                  "content": "Сновидения о кристаллах означают ясность и скрытые истины. Пещера предполагает самоанализ и открытие внутренних ресурсов."
                },
                "vanga": {
                  "title": "Сонник Ванги",
                  "content": "Кристаллы во сне представляют духовное очищение и прозрение. Пещера указывает на путешествие в подсознание, чтобы раскрыть скрытый потенциал."
                },
                "chinese": {
                  "title": "Китайский сонник",
                  "content": "Хрустальная пещера символизирует процветание и удачу. Река света означает гармоничный поток энергии и успех в начинаниях."
                },
                "muslim": {
                  "title": "Мусульманский сонник",
                  "content": "В исламском толковании снов пещера может символизировать убежище и божественную защиту, как в истории о Семи Спящих. Свет является признаком божественного руководства и мудрости, ниспосланных вам."
                }
              }
            }
          }
        }
      ],
      "profile": {
        "birthDate": "",
        "birthTime": "",
        "birthPlace": ""
      }
    }
  }
}