{
  "title": "Путешествие по Хрустальной Пещере",
  "keyImages": ["кристаллы", "пещера", "река", "свет"],
  "snapshotSummary": "Этот сон символизирует путь самопознания и внутренней ясности. Хрустальная пещера представляет ваш внутренний мир, а река света предполагает, что для вас открывается путь духовного и эмоционального просветления.",
  "lenses": {
    "psychoanalytic": {
      "title": "Психоанализ",
      "insights": [
        {
          "name": "Поиск внутреннего убежища",
          "description": "Пещера в вашем сне — это не просто место, а символ безопасности и уединения. То, как вы исследуете ее, говорит о вашем подсознательном желании найти защищенное пространство для самоанализа, вдали от внешнего давления.",
          "recommendation": "Доверьтесь этой внутренней потребности в убежище. Попробуйте выделить небольшую часть дня для спокойных размышлений. Вы можете вести дневник своих мыслей, медитировать или просто сидеть в тишине. Структурирование этих моментов поможет вам обработать свои чувства и снизить тревогу."
        },
        {
          "name": "Подавленное стремление к самовыражению",
          "description": "Светящаяся река символизирует мощный поток творческой и жизненной энергии. Однако тот факт, что она заперта в пещере, может указывать на то, что вы чувствуете, будто ваши таланты или истинные желания сдерживаются обстоятельствами или внутренними барьерами.",
          "recommendation": "Подумайте, что мешает вашему самовыражению. Начните с малого: займитесь хобби, которое вы давно откладывали. Позвольте себе творить без ожидания результата, просто ради процесса. Это поможет высвободить сдерживаемую энергию."
        },
        {
          "name": "Ценность ясности и структуры",
          "description": "Кристаллы, с их идеальной и упорядоченной структурой, отражают вашу потребность в ясности, порядке и понимании. Их созерцание во сне говорит о поиске четких ответов на сложные жизненные вопросы.",
          "recommendation": "Ваш разум ищет порядок. Попробуйте применить этот принцип в жизни: составьте план на неделю, разбейте большую задачу на маленькие шаги. Наведение порядка во внешнем мире часто помогает обрести внутреннюю ясность."
        }
      ],
      "schools": {
        "freud": {
          "title": "По Фрейду",
          "content": "С точки зрения Фрейда, ваш сон — это театр бессознательного. Хрустальная пещера — это не просто символ убежища или материнской утробы, это пространство, где ваши подавленные желания (либидо) и неразрешенные конфликты раннего детства выходят на поверхность. Река света — это поток вашей психической энергии, которая ищет выход."
        },
        "jung": {
          "title": "По Юнгу",
          "content": "Юнгианский анализ видит в вашем сне путешествие к индивидуации — процессу становления целостной личности. Пещера — это архетип Великого Материнского, вход в глубины коллективного бессознательного. Кристаллы — это символы Самости, вашего истинного внутреннего центра, сияющего и многогранного."
        },
        "adler": {
          "title": "По Адлеру",
          "content": "Для Адлера ключевым мотивом является стремление к превосходству. Ваш сон о путешествии по хрустальной пещере — это метафора вашего жизненного стиля и стремления к уникальности и признанию. Вы хотите найти свой «блестящий» путь, доказать свою значимость."
        }
      }
    },
    "tarot": {
      "title": "Таро",
      "spread": [
        {
          "position": "Причина сна",
          "cardName": "Император",
          "interpretation": "Появление Императора говорит о том, что сон был вызван недавней потребностью в порядке и контроле в вашей жизни. Возможно, вы столкнулись с хаосом или неопределенностью, и ваше подсознание ищет стабильности и структуры."
        },
        {
          "position": "Тема сна",
          "cardName": "Луна",
          "interpretation": "Центральная тема — это навигация в неизведанном. Подобно Луне, ваш сон освещает тревоги и интуитивные предчувствия, которые обычно скрыты в тени. Это путешествие в глубины вашего подсознания."
        },
        {
          "position": "Препятствие/Блок",
          "cardName": "Колесница",
          "interpretation": "Колесница указывает на борьбу с силой воли. Возможно, вы чувствуете, что ваше стремление двигаться вперед блокируется противоречивыми желаниями или отсутствием четкого направления. Вы тянете себя в разные стороны."
        },
        {
          "position": "Сообщение/Совет",
          "cardName": "Сила",
          "interpretation": "Совет заключается в том, чтобы подходить к своим проблемам с мужеством и состраданием. Укротите своего внутреннего «зверя» не силой, а мягкой решимостью. Примите свои инстинкты, но управляйте ими."
        },
        {
          "position": "Урок/Потенциал",
          "cardName": "Влюбленные",
          "interpretation": "Главный урок — это сделать выбор, который соответствует вашим самым глубоким ценностям. Этот сон дает возможность гармонизировать противоречивые части вашей личности и найти внутреннее единство."
        }
      ],
      "summary": "В целом, этот расклад показывает путешествие от потребности в контроле (Император) через пейзаж неопределенности (Луна). Путь вперед требует внутренней силы (Сила), чтобы преодолеть внутренние конфликты (Колесница) и сделать гармоничный выбор (Влюбленные). Доверяйте своей интуиции, но действуйте с сострадательным сердцем."
    },
    "astrology": {
      "title": "Астрология",
      "paragraphs": {
        "astrological": {
          "title": "Астрологический подход",
          "content": "Этот сон может отражать мощный транзит Нептуна, растворяющий старые границы и открывающий вас для духовных прозрений. Ясность кристаллов может быть влиянием Меркурия, приносящим ясные мысли о вашем внутреннем мире."
        },
        "numerology": {
          "title": "Нумерология",
          "content": "Количество ключевых образов — четыре, что символизирует стабильность, структуру и заземление. Ваше духовное путешествие, хотя и просвещающее, ведет вас к построению более стабильного и надежного фундамента в вашей жизни."
        }
      }
    },
    "folkloric": {
      "title": "Фольклор",
      "paragraphs": {
        "miller": {
          "title": "Сонник Миллера",
          "content": "Видеть во сне чистые, сверкающие кристаллы предвещает процветание и искреннюю дружбу. Пещера означает, что вы преодолеете своих врагов и препятствия благодаря своим скрытым талантам и усилиям."
        },
        "tsvetkov": {
          "title": "Сонник Цветкова",
          "content": "Сновидения о кристаллах означают ясность и скрытые истины. Пещера предполагает самоанализ и открытие внутренних ресурсов."
        }
      }
    }
  }
}
