{
  "title": "Путешествие по Хрустальной Пещере",
  "processedText": "Я оказался в густом, туманном лесу, где деревья были настолько высокими, что их верхушки терялись в облаках. Воздух был влажным и пах мхом и землей. Несмотря на полумрак, не было страшно, скорее любопытно. Я шел по едва заметной тропинке, которая вилась между гигантскими корнями, похожими на спящих змей.\n\nТропинка вывела меня к небольшой поляне, в центре которой стоял огромный валун, покрытый древними рунами. Когда я прикоснулся к нему, руны вспыхнули мягким зеленым светом, и земля под ногами задрожала. Валун сдвинулся, открывая темный проход, ведущий вниз. Я без колебаний шагнул внутрь.\n\nПроход превратился в длинную винтовую лестницу, стены которой были сделаны из полированного обсидиана. С каждой ступенькой вниз я слышал тихий, мелодичный гул, который становился все громче. Лестница привела меня в огромный подземный зал. Потолок был усеян светящимися кристаллами, напоминающими звезды, а в центре зала находилось кристально чистое озеро.\n\nЯ подошел к воде и увидел в ней свое отражение, но оно было старше и мудрее. Из глубины озера поднялась фигура, сотканная из света, и протянула мне руку. В этот момент я почувствовал невероятное спокойствие и понимание того, что нашел что-то очень важное, что давно искал. Затем я проснулся.",
  "snapshotSummary": null,
  "lenses": {
    "dreambook": {
      "title": "Сонник",
      "content": "Сон о **пещере** с **кристаллами** приснился вам не случайно. По соннику Миллера, **пещера** традиционно символизирует **укрытие**, тайну и возвращение к истокам. Это образ материнского лона, места, где вы можете спрятаться от внешнего мира и найти покой. Если вы видите **пещеру** с **кристаллами** — это особенно благоприятный знак.\n\n**Кристаллы** в сновидении означают **ясность** мысли, **духовный рост** и раскрытие внутреннего потенциала. Каждый **кристалл** — это грань вашей личности, которая готова засиять. Сверкающая **пещера** говорит о том, что вы стоите на пороге важного **открытия** о себе. По соннику Ванги, **светящиеся** предметы во сне указывают на приближение важных событий.\n\n**Озеро** и **вода** символизируют поток жизненной энергии и эмоций. **Светящаяся вода** указывает на **очищение** и **обновление**. Если вы видите свое **отражение** в такой **воде** — это знак того, что вам предстоит увидеть себя в новом **свете**, принять свою истинную природу. Сонник Фрейда связывает **воду** с эмоциональной сферой и бессознательным.\n\n**Лес** и **деревья** в начале сна — это символ жизненного пути и неопределенности. По Ассирийскому соннику, **густой лес** означает период поиска и внутренних сомнений, но успешный выход из **леса** обещает разрешение текущих проблем. **Туман** добавляет элемент тайны и скрытых возможностей.\n\n**Руны** на **валуне** и **зеленый свет** — это знаки мудрости предков и духовного руководства. По соннику Нострадамуса, **древние символы** во сне указывают на то, что вы получаете важное послание от своего подсознания. Ваш сон призывает вас прислушаться к **интуиции** и довериться внутреннему голосу. Путешествие через **лестницу** вниз символизирует погружение в глубины собственной души, где вас ждут важные **открытия** и **гармония**.",
      "highlightWords": [
        "пещера",
        "пещеру",
        "кристаллами",
        "кристаллы",
        "кристалл",
        "укрытие",
        "ясность",
        "духовный рост",
        "открытия",
        "открытие",
        "светящиеся",
        "светящаяся",
        "озеро",
        "вода",
        "воде",
        "воду",
        "очищение",
        "обновление",
        "отражение",
        "свете",
        "лес",
        "леса",
        "деревья",
        "туман",
        "руны",
        "валуне",
        "зеленый свет",
        "интуиции",
        "лестницу",
        "гармония"
      ]
    },
    "psychoanalytic": {
      "title": "Психоанализ",
      "insights": [
        {
          "name": "Поиск внутреннего убежища",
          "description": "Пещера в вашем сне — это не просто место, а символ безопасности и уединения. То, как вы ее исследуете, говорит о подсознательном желании найти защищенное пространство для саморефлексии, вдали от внешнего давления."
        },
        {
          "name": "Конфликт с внутренним 'Я'",
          "description": "Препятствия на пути к выходу из пещеры символизируют внутренние барьеры, которые вы сами себе устанавливаете. Возможно, существует часть вас, которая сопротивляется изменениям или боится неопределенности будущего."
        },
        {
          "name": "Порог зрелости",
          "description": "Свет, который вы видите в конце, — это не только выход, но и символ новой цели или нового этапа в жизни. Ваше стремление к нему говорит о готовности к личностному росту и принятию новых вызовов."
        }
      ],
      "schools": {
        "freud": {
          "title": "По Фрейду",
          "content": "С точки зрения Фрейда, ваш сон — это театр бессознательного. Хрустальная пещера — это не просто символ убежища или материнской утробы, это пространство, где ваши подавленные желания (либидо) и неразрешенные конфликты раннего детства выходят на поверхность. Река света — это поток вашей психической энергии, которая ищет выход."
        },
        "jung": {
          "title": "По Юнгу",
          "content": "Юнгианский анализ видит в вашем сне путешествие к индивидуации — процессу становления целостной личности. Пещера — это архетип Великого Материнского, вход в глубины коллективного бессознательного. Кристаллы — это символы Самости, вашего истинного внутреннего центра, сияющего и многогранного."
        },
        "adler": {
          "title": "По Адлеру",
          "content": "С точки зрения Адлера, сон подчеркивает ваше стремление к преодолению чувства неполноценности. Пещера — это начальная точка, 'минус', из которого вы стремитесь к 'плюсу' — свету, символизирующему признание и самореализацию. Весь сюжет сна — это метафора вашего жизненного стиля, направленного на рост и компенсацию."
        }
      },
      "recommendation": {
        "title": "Практика сострадания к себе",
        "content": "Ваш сон говорит о глубокой потребности в безопасности и принятии. Вместо того чтобы критиковать себя за внутренние конфликты или страхи, попробуйте отнестись к этим чувствам с добротой, как если бы вы утешали близкого друга. Спросите себя: 'Какую мою потребность сейчас игнорируют? В какой поддержке я нуждаюсь?'.\n\nЭтот сдвиг от самокритики к самосостраданию — не потакание слабостям, а ключ к внутренней силе. Признавая свои уязвимые стороны без осуждения, вы перестаете тратить энергию на борьбу с собой и освобождаете ее для реального роста и движения к 'свету', который вы видели во сне."
      }
    },
    "tarot": {
      "title": "Таро",
      "spread": [
        {
          "position": "Причина сна",
          "interpretation": "Появление карты <<cardName>> говорит о том, что сон был вызван недавней потребностью в порядке и контроле в вашей жизни. Возможно, вы столкнулись с хаосом или неопределенностью, и ваше подсознание ищет стабильности и структуры."
        },
        {
          "position": "Тема сна",
          "interpretation": "Центральная тема — это навигация в неизведанном. Подобно карте <<cardName>>, ваш сон освещает тревоги и интуитивные предчувствия, которые обычно скрыты в тени. Это путешествие в глубины вашего подсознания."
        },
        {
          "position": "Препятствие/Блок",
          "interpretation": "Карта <<cardName>> указывает на борьбу с силой воли. Возможно, вы чувствуете, что ваше стремление двигаться вперед блокируется противоречивыми желаниями или отсутствием четкого направления. Вы тянете себя в разные стороны."
        },
        {
          "position": "Сообщение/Совет",
          "interpretation": "Совет карты <<cardName>> заключается в том, чтобы подходить к своим проблемам с мужеством и состраданием. Укротите своего внутреннего «зверя» не силой, а мягкой решимостью. Примите свои инстинкты, но управляйте ими."
        },
        {
          "position": "Урок/Потенциал",
          "interpretation": "Главный урок карты <<cardName>> — это сделать выбор, который соответствует вашим самым глубоким ценностям. Этот сон дает возможность гармонизировать противоречивые части вашей личности и найти внутреннее единство."
        }
      ],
      "summary": "В целом, этот расклад показывает путешествие от потребности в контроле через пейзаж неопределенности. Путь вперед требует внутренней силы, чтобы преодолеть внутренние конфликты и сделать гармоничный выбор. Доверяйте своей интуиции, но действуйте с сострадательным сердцем."
    },
    "astrology": {
      "title": "Астрология",
      "celestialMap": {
        "moonPhase": {
          "name": "Полнолуние",
          "phase": "full_moon",
          "text": "Влияние полнолуния на ваш сон могло усилить эмоциональную напряженность и выявить скрытые аспекты вашей личности."
        },
        "moonSign": {
          "name": "Скорпион",
          "emoji": "♏️",
          "text": "Луна в Скорпионе добавляет сну глубины и интенсивности, подчеркивая темы трансформации и столкновения с внутренними страхами."
        }
      },
      "topTransits": {
        "explanation": "Транзиты — это текущее положение планет на небе, которое взаимодействует с вашей личной натальной картой. Они как космическая погода, влияющая на ваше подсознание и сны.",
        "insights": [
          {
            "p1": "pluto",
            "p2": "moon",
            "aspect": "square",
            "power": 8,
            "tagline": "Плутон в квадрате к Луне",
            "title": "Влияние: Плутон и Луна",
            "interpretation": "Этот транзит часто выявляет скрытые эмоциональные конфликты и заставляет столкнуться с теневыми сторонами личности. Ваш сон о пещере — прямое отражение этого процесса.",
            "lesson": "Урок этого транзита — научиться принимать свои темные стороны и использовать их как источник силы, а не страха."
          },
          {
            "p1": "neptune",
            "p2": "sun",
            "aspect": "trine",
            "power": 6,
            "tagline": "Нептун в трине к Солнцу",
            "title": "Влияние: Нептун и Солнце",
            "interpretation": "Этот гармоничный аспект усиливает интуицию и духовные поиски. Река света в вашем сне символизирует вдохновение и ясность, которые приносит этот транзит.",
            "lesson": "Доверяйте своей интуиции и творческим порывам. Сейчас вы можете легко находить ответы внутри себя."
          },
          {
            "p1": "uranus",
            "p2": "mercury",
            "aspect": "conjunction",
            "power": 7,
            "tagline": "Уран в соединении с Меркурием",
            "title": "Влияние: Уран и Меркурий",
            "interpretation": "Это аспект озарений и внезапных идей. Кристаллы в вашем сне могут символизировать внезапное понимание или новую идею, которая готова 'кристаллизоваться' в вашем сознании.",
            "lesson": "Будьте открыты для неожиданных мыслей и решений. Ваше подсознание пытается донести до вас что-то нетривиальное."
          }
        ]
      },
      "cosmicPassport": {
        "sun": {
          "title": "Солнце в знаке Дева",
          "tagline": "Ваше Солнце в Деве наделяет вас аналитическим умом и стремлением к порядку. В контексте сна, это может проявляться как желание разобраться в своих чувствах и найти логическое объяснение происходящему."
        },
        "moon": {
          "title": "Луна в знаке Рак",
          "tagline": "Ваша Луна в Раке говорит о глубокой эмоциональной чувствительности и потребности в безопасности. Пещера в вашем сне — это прямое отражение этой потребности в надежном убежище."
        }
      },
      "summary": "Это общий вывод от астролога из моковых данных, который связывает все астрологические факторы воедино, объясняя, как космические влияния сформировали образы и сюжет вашего сна."
    }
  }
}
