{
  "title": "Путешествие по Хрустальной Пещере",
  "keyImages": ["кристаллы", "пещера", "река", "свет"],
  "snapshotSummary": "Этот сон символизирует путь самопознания и внутренней ясности. Хрустальная пещера представляет ваш внутренний мир, а река света предполагает, что для вас открывается путь духовного и эмоционального просветления.",
  "lenses": {
    "psychoanalytic": {
      "title": "Психоанализ",
      "insights": [
        {
          "name": "Поиск внутреннего убежища",
          "description": "Пещера в вашем сне — это не просто место, а символ безопасности и уединения. То, как вы ее исследуете, говорит о подсознательном желании найти защищенное пространство для саморефлексии, вдали от внешнего давления."
        },
        {
          "name": "Конфликт с внутренним 'Я'",
          "description": "Препятствия на пути к выходу из пещеры символизируют внутренние барьеры, которые вы сами себе устанавливаете. Возможно, существует часть вас, которая сопротивляется изменениям или боится неопределенности будущего."
        },
        {
          "name": "Порог зрелости",
          "description": "Свет, который вы видите в конце, — это не только выход, но и символ новой цели или нового этапа в жизни. Ваше стремление к нему говорит о готовности к личностному росту и принятию новых вызовов."
        }
      ],
      "schools": {
        "freud": {
          "title": "По Фрейду",
          "content": "С точки зрения Фрейда, ваш сон — это театр бессознательного. Хрустальная пещера — это не просто символ убежища или материнской утробы, это пространство, где ваши подавленные желания (либидо) и неразрешенные конфликты раннего детства выходят на поверхность. Река света — это поток вашей психической энергии, которая ищет выход."
        },
        "jung": {
          "title": "По Юнгу",
          "content": "Юнгианский анализ видит в вашем сне путешествие к индивидуации — процессу становления целостной личности. Пещера — это архетип Великого Материнского, вход в глубины коллективного бессознательного. Кристаллы — это символы Самости, вашего истинного внутреннего центра, сияющего и многогранного."
        },
        "adler": {
          "title": "По Адлеру",
          "content": "С точки зрения Адлера, сон подчеркивает ваше стремление к преодолению чувства неполноценности. Пещера — это начальная точка, 'минус', из которого вы стремитесь к 'плюсу' — свету, символизирующему признание и самореализацию. Весь сюжет сна — это метафора вашего жизненного стиля, направленного на рост и компенсацию."
        }
      },
      "recommendations": [
        {
          "title": "Практика осознанного уединения",
          "content": "Ваш сон указывает на сильную потребность в безопасном пространстве для мыслей. Попробуйте выделить 15-20 минут в день для осознанного уединения без гаджетов. Это не эскапизм, а необходимая 'перезагрузка'. Можете вести дневник или просто медитировать. Это упражнение поможет снизить фоновую тревогу и лучше понять свои истинные желания."
        },
        {
          "title": "Техника 'Разговор с препятствием'",
          "content": "Когда вы сталкиваетесь с трудностями в реальной жизни, представьте это препятствие как персонажа из вашего сна. Мысленно или на бумаге задайте ему вопросы: 'Чему ты хочешь меня научить? Какую мою часть ты представляешь?'. Этот простой прием гештальт-терапии может помочь превратить внутренний конфликт из барьера в ресурс для роста."
        }
      ]
    },
    "tarot": {
      "title": "Таро",
      "spread": [
        {
          "position": "Причина сна",
          "interpretation": "Появление карты <<cardName>> говорит о том, что сон был вызван недавней потребностью в порядке и контроле в вашей жизни. Возможно, вы столкнулись с хаосом или неопределенностью, и ваше подсознание ищет стабильности и структуры."
        },
        {
          "position": "Тема сна",
          "interpretation": "Центральная тема — это навигация в неизведанном. Подобно карте <<cardName>>, ваш сон освещает тревоги и интуитивные предчувствия, которые обычно скрыты в тени. Это путешествие в глубины вашего подсознания."
        },
        {
          "position": "Препятствие/Блок",
          "interpretation": "Карта <<cardName>> указывает на борьбу с силой воли. Возможно, вы чувствуете, что ваше стремление двигаться вперед блокируется противоречивыми желаниями или отсутствием четкого направления. Вы тянете себя в разные стороны."
        },
        {
          "position": "Сообщение/Совет",
          "interpretation": "Совет карты <<cardName>> заключается в том, чтобы подходить к своим проблемам с мужеством и состраданием. Укротите своего внутреннего «зверя» не силой, а мягкой решимостью. Примите свои инстинкты, но управляйте ими."
        },
        {
          "position": "Урок/Потенциал",
          "interpretation": "Главный урок карты <<cardName>> — это сделать выбор, который соответствует вашим самым глубоким ценностям. Этот сон дает возможность гармонизировать противоречивые части вашей личности и найти внутреннее единство."
        }
      ],
      "summary": "В целом, этот расклад показывает путешествие от потребности в контроле через пейзаж неопределенности. Путь вперед требует внутренней силы, чтобы преодолеть внутренние конфликты и сделать гармоничный выбор. Доверяйте своей интуиции, но действуйте с сострадательным сердцем."
    },
    "culturology": {
      "title": "Культурология",
      "preface": {
          "title": "Макро-анализ Сновидения",
          "content": "Это моковое предисловие для линзы Культурология."
      },
      "analysis": [
          {
              "title": "Моковый Архетип 1",
              "content": "Это моковый анализ для первого архетипа."
          }
      ],
      "insight": {
          "title": "Моковый Инсайт",
          "content": "Это моковый инсайт.",
          "recommendation": "Это моковая рекомендация."
      }
    },
    "astrology": {
      "title": "Астрология",
      "dreamAtmosphere": {
        "interpretation": "Интерпретация лунной атмосферы из мока."
      },
      "topTransits": {
        "title": "Ключевые Транзиты",
        "insights": [
          {
            "transit_planet": "saturn",
            "aspect_type": "square",
            "natal_planet": "moon",
            "interpretation": "Моковая интерпретация для первого транзита (Сатурн квадрат Луна)."
          },
          {
            "transit_planet": "pluto",
            "aspect_type": "trine",
            "natal_planet": "sun",
            "interpretation": "Моковая интерпретация для второго транзита (Плутон трин Солнце)."
          },
          {
            "transit_planet": "uranus",
            "aspect_type": "conjunction",
            "natal_planet": "mercury",
            "interpretation": "Моковая интерпретация для третьего транзита (Уран соединение Меркурий)."
          }
        ]
      },
      "cosmicPassport": {
        "interpretation": "Моковая интерпретация для космического паспорта."
      },
      "summary": "Это общий вывод от астролога из моковых данных, который связывает все астрологические факторы воедино."
    }
  }
}
